Tekla.Structures.Datatype.Double
The Double datatype.

Tekla.Structures.Datatype.Double.#ctor(System.Double)
Creates a new double datatype instance.
value: The value for the double datatype.

Tekla.Structures.Datatype.Double.Value
The value of the double datatype.

Tekla.Structures.Datatype.Double.op_Implicit(Tekla.Structures.Datatype.Double)~System.Double
Converts from Datatype.Double to double.
From: The value to be converted.
Returns: The converted double value.

Tekla.Structures.Datatype.Double.op_Implicit(System.Double)~Tekla.Structures.Datatype.Double
Converts from double to Datatype.Double.
From: The value to be converted.
Returns: The converted Datatype.Double value.

Tekla.Structures.Datatype.Double.op_Equality(System.Double,Tekla.Structures.Datatype.Double)
Compares a double value with a Datatype.Double value.
Left: The double value to be compared.
Right: The Datatype.Double value to be compared.
Returns: True if the values are the same.

Tekla.Structures.Datatype.Double.op_Inequality(System.Double,Tekla.Structures.Datatype.Double)
Compares a double value with a Datatype.Double value.
Left: The double value to be compared.
Right: The Datatype.Double value to be compared.
Returns: True if the values are different.

Tekla.Structures.Datatype.Double.Equals(System.Object)
Returns a value that indicates whether the current instance is equal to the given object.
Obj: The object to be used for comparing.
Returns: True if the given object has the same value as the current instance.

Tekla.Structures.Datatype.Double.Equals(Tekla.Structures.Datatype.Double)
Indicates whether the current object is equal to another object of the same type.
other: The object to be compared with the current object.
Returns: True if the current object is equal to the other object; otherwise, false.

Tekla.Structures.Datatype.Double.CompareTo(Tekla.Structures.Datatype.Double)
Compares the current object with another object of the same type.
other: The object to be compared with the current object.
Returns:
A 32-bit signed integer that indicates the relative order of the objects being compared.
The return value has the following meanings:
Value
Meaning
Less than zero
The current object is less than the other object.
Zero
The current object is equal to the other object.
Greater than zero
The current object is greater than the other object.

Tekla.Structures.Datatype.Double.GetHashCode
Returns the hash code for the current instance.
Returns: A hash code for the current Double instance.

Tekla.Structures.Datatype.Double.ToString
Returns the string representation of the object.
Returns: The string representation of the object.

Tekla.Structures.Datatype.Double.GetSchema
Gets the XML Schema for the datatype.
Returns: The datatype's XML Schema.

Tekla.Structures.Datatype.Double.ReadXml(System.Xml.XmlReader)
Parses a new value from the given reader.
reader: The reader to be used.

Tekla.Structures.Datatype.Double.WriteXml(System.Xml.XmlWriter)
Writes the value as XML to the given writer.
writer: The writer to be used.